physics/bjorken-drell.org
#+TITLE: Bjorken and Drell - Reading notes
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2024-11-09T08:49:00-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5 num:2
#+HTML_DOCTYPE: html5
# Created Saturday November  9, 2024 at  8:49AM
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

These are my reading notes on Bjorken and Drell's
{{{book-title(Relativistic Quantum Mechanics)}}} and
{{{book-title(Relativistic Quantum Field Theory)}}}.
The organization uses their chapter and section names.

I will also use their equation numbering (which seems to be numbered
within chapters).

I am deliberating whether I should use their West-coast metric
conventions, or use my preferred East-coast metric conventions.

* The Dirac Equation
:PROPERTIES:
:CUSTOM_ID: h-12715b37-7cbd-48b9-b370-2157e3f8da42
:END:

** Formulation of Relativistic Quantum Theory
:PROPERTIES:
:CUSTOM_ID: h-b1ab5d0b-757e-4820-ac19-8a64bb1c7024
:END:

- Requirement of relativity: laws of motion valid in one inertial
  system must be true in all inertial systems.
- A "correct quantum theory" should satisfy this requirement of relativity.
- Mathematically: a relativistic quantum theory must be formulated in
  a Lorentz covariant form.
- Review of the principles of nonrelativistic quantum mechanics (they
  cite Pauli's "Handbuch der Physik"; Schiff's {{{book-title(Quantum Mechanics)}}},
  second ed., McGraw-Hill, 1955; Dirac's {{{book-title(Principles of Quantum Mechanics)}}},
  fourth ed., Oxford University Press, 1958):
  1. A physical system is described by a state function $\Phi$. This
     is usually written explicitly using coordinates $\psi(q,s,t)$
     which is a complex function of coordinates $q=(q_{1},\dots,q_{m})$, time $t$, and any
     additional degrees of freedom $s$ (like spin).

     This has no direct physical interpretation. Instead,
     $|\psi(q,s,t)|^{2}\geq0$ is interpreted as the probability of the
     system having values $(q,s)$ at time $t$. This requires the sum
     of all $|\psi(q,s,t)|^{2}$ to be finite.
  2. Every physical observable is represented by a linear Hermitian
     operator. In particular, the canonical momentum $p_{i}$ the
     operator in coordinate-space is $p_{i} \to -\I\hbar\partial/\partial q_{i}$.
  3. A physical system is in an eigenstate of the operator $\Omega$ if
     \begin{equation*}\tag{1.1}
     \Omega\Phi_{n}=\omega_{n}\Phi_{n}
     \end{equation*}
     where $\Phi_{n}$ is the n-th
     eigenstate corresponding to eigenvalue $\omega_{n}$. For
     Hermitian operators, $\omega_{n}$ is real.

     We can write this in local coordinates as
     $\Omega(q,s,t)\psi_{n}(q,s,t)=\omega_{n}\psi_{n}(q,s,t)$.
  4. Expansion postulate: an arbitrary wave function for a physical
     system can be expanded in a complete orthognormal set of
     eigenfunctions $\psi_{n}$ of a complete set of commuting
     operators $\Omega_{n}$. We write this as
     $\psi = \sum_{n}a_{n}\psi_{n}$
     where the requirement of orthonormality is
     $$\sum_{s}\int\psi^{*}_{n}(q_{1},\dots,s,\dots,t)\psi_{m}(q_{1},\dots,s,\dots,t)\,\D q_{1}\dots=\delta_{m,n}$$
     (this is how they write it, it's a little ambiguous).
     The coefficients $a_{n}$, we interpret $|a_{n}|^{2}$ as the
     probability of finding the system in this eigenstate.
  5. The result of a measurement of a physical observable is any one
     of its eigenvalues.
  6. The development ofa physical system is expressed by the
     Schrodinger equation
     \begin{equation*}\tag{1.2}
     \I\hbar\partial_{t}\psi = H\psi
     \end{equation*}
     where $\partial_{t} = \partial/\partial t$.

     A closed system has no explicit time dependence, so
     $\partial_{t}\psi=0$ for closed systems.

     Corollary (superposition principle): linearity of $H$ and
     conservation of probability from the Hermitian property of $H$:
     \begin{align*}\tag{1.3}
     &\frac{\D}{\D t}\sum_{s}\int\psi^{*}\psi(\D q_{1}\cdots)\\
     &=\frac{\I}{\hbar}\sum_{s}\int[(H\psi)^{\ast}\psi-\psi^{\ast}(H\psi)](\D q_{1}\cdots)\\
     &=0
     \end{align*}
- These six principles are taken to underpin quantum theory, the goal
  will be to maintain them.

