docs/physics/bjorken-drell.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bjorken and Drell - Reading notes</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Bjorken and Drell - Reading notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-12715b37-7cbd-48b9-b370-2157e3f8da42">1. The Dirac Equation</a>
<ul>
<li><a href="#h-b1ab5d0b-757e-4820-ac19-8a64bb1c7024">1.1. Formulation of Relativistic Quantum Theory</a></li>
<li><a href="#h-e9387302-f616-41ec-9bb6-1f402b758648">1.2. Early Attempts</a></li>
<li><a href="#h-9c0bf147-d058-4998-bb58-bbfe083e4aac">1.3. The Dirac Equation</a></li>
<li><a href="#h-d70ace27-4b3c-4710-bf69-f87d755a0d1b">1.4. Nonrelativistic Correspondence</a></li>
</ul>
</li>
<li><a href="#h-43055381-a20c-4120-9f7b-82c26583e611">2. Lorentz Covariance of the Dirac Equation</a>
<ul>
<li><a href="#h-1c54f957-f7a0-4697-a67a-1acd5fa312b2">2.1. Covariant form of the Dirac Equation</a></li>
<li><a href="#h-7713296f-781b-422b-90d0-bd0a6ddd2bbd">2.2. Proof of Covariance</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These are my reading notes on Bjorken and Drell's
<cite class="book-title">Relativistic Quantum Mechanics</cite> and
<cite class="book-title">Relativistic Quantum Field Theory</cite>.
The organization uses their chapter and section names.
</p>

<p>
I will also use their equation numbering (which seems to be numbered
within chapters).
</p>

<p>
I am deliberating whether I should use their West-coast metric
conventions, or use my preferred East-coast metric conventions.
</p>
<div id="outline-container-h-12715b37-7cbd-48b9-b370-2157e3f8da42" class="outline-2">
<h2 id="h-12715b37-7cbd-48b9-b370-2157e3f8da42"><span class="section-number-2">1.</span> The Dirac Equation</h2>
<div class="outline-text-2" id="text-h-12715b37-7cbd-48b9-b370-2157e3f8da42">
</div>
<div id="outline-container-h-b1ab5d0b-757e-4820-ac19-8a64bb1c7024" class="outline-3">
<h3 id="h-b1ab5d0b-757e-4820-ac19-8a64bb1c7024"><span class="section-number-3">1.1.</span> Formulation of Relativistic Quantum Theory</h3>
<div class="outline-text-3" id="text-h-b1ab5d0b-757e-4820-ac19-8a64bb1c7024">
<ul class="org-ul">
<li>Requirement of relativity: laws of motion valid in one inertial
system must be true in all inertial systems.</li>
<li>A "correct quantum theory" should satisfy this requirement of relativity.</li>
<li>Mathematically: a relativistic quantum theory must be formulated in
a Lorentz covariant form.</li>
<li>Review of the principles of nonrelativistic quantum mechanics (they
cite Pauli's "Handbuch der Physik"; Schiff's <cite class="book-title">Quantum Mechanics</cite>,
second ed., McGraw-Hill, 1955; Dirac's <cite class="book-title">Principles of Quantum Mechanics</cite>,
fourth ed., Oxford University Press, 1958):
<ol class="org-ol">
<li><p>
A physical system is described by a state function \(\Phi\). This
is usually written explicitly using coordinates \(\psi(q,s,t)\)
which is a complex function of coordinates \(q=(q_{1},\dots,q_{m})\), time \(t\), and any
additional degrees of freedom \(s\) (like spin).
</p>

<p>
This has no direct physical interpretation. Instead,
\(|\psi(q,s,t)|^{2}\geq0\) is interpreted as the probability of the
system having values \((q,s)\) at time \(t\). This requires the sum
of all \(|\psi(q,s,t)|^{2}\) to be finite.
</p></li>
<li>Every physical observable is represented by a linear Hermitian
operator. In particular, the canonical momentum \(p_{i}\) the
operator in coordinate-space is \(p_{i} \to -\I\hbar\partial/\partial q_{i}\).</li>
<li><p>
A physical system is in an eigenstate of the operator \(\Omega\) if
</p>
\begin{equation*}\tag{1.1}
\Omega\Phi_{n}=\omega_{n}\Phi_{n}
\end{equation*}
<p>
where \(\Phi_{n}\) is the n-th
eigenstate corresponding to eigenvalue \(\omega_{n}\). For
Hermitian operators, \(\omega_{n}\) is real.
</p>

<p>
We can write this in local coordinates as
\(\Omega(q,s,t)\psi_{n}(q,s,t)=\omega_{n}\psi_{n}(q,s,t)\).
</p></li>
<li>Expansion postulate: an arbitrary wave function for a physical
system can be expanded in a complete orthognormal set of
eigenfunctions \(\psi_{n}\) of a complete set of commuting
operators \(\Omega_{n}\). We write this as
\(\psi = \sum_{n}a_{n}\psi_{n}\)
where the requirement of orthonormality is
\[\sum_{s}\int\psi^{*}_{n}(q_{1},\dots,s,\dots,t)\psi_{m}(q_{1},\dots,s,\dots,t)\,\D q_{1}\dots=\delta_{m,n}\]
(this is how they write it, it's a little ambiguous).
The coefficients \(a_{n}\), we interpret \(|a_{n}|^{2}\) as the
probability of finding the system in this eigenstate.</li>
<li>The result of a measurement of a physical observable is any one
of its eigenvalues.</li>
<li><p>
The development ofa physical system is expressed by the
Schrodinger equation
</p>
\begin{equation*}\tag{1.2}
\I\hbar\partial_{t}\psi = H\psi
\end{equation*}
<p>
where \(\partial_{t} = \partial/\partial t\).
</p>

<p>
A closed system has no explicit time dependence, so
\(\partial_{t}\psi=0\) for closed systems.
</p>

<p>
Corollary (superposition principle): linearity of \(H\) and
conservation of probability from the Hermitian property of \(H\):
</p>
\begin{align*}\tag{1.3}
&\frac{\D}{\D t}\sum_{s}\int\psi^{*}\psi(\D q_{1}\cdots)\\
&=\frac{\I}{\hbar}\sum_{s}\int[(H\psi)^{\ast}\psi-\psi^{\ast}(H\psi)](\D q_{1}\cdots)\\
&=0
\end{align*}</li>
</ol></li>
<li>These six principles are taken to underpin quantum theory, the goal
will be to maintain them.</li>
</ul>
</div>
</div>
