physics/bjorken-drell.org
** Early Attempts
:PROPERTIES:
:CUSTOM_ID: h-e9387302-f616-41ec-9bb6-1f402b758648
:END:

- The free particle has its Hamiltonian be
  \begin{equation*}\tag{1.4}
  H = \frac{p^{2}}{2m}.
  \end{equation*}
- The quantum counterpart takes
  \begin{equation*}\tag{1.5}
  H\to\I\hbar\partial_{t},\quad\vec{p}\to-\I\hbar\vec{\nabla}
  \end{equation*}
- Thus we obtain the nonrelativistic Schrodinger equation
  \begin{equation*}\tag{1.6}
  \I\hbar\partial_{t}\psi(q,t) = \frac{-\hbar^{2}}{2m}\nabla^{2}\psi(q,t).
  \end{equation*}
- Equations (1.4) and (1.6) are noncovariant and therefore
  unsatisfactory for relativistic quantum mechanics. I.e., the
  left-hand sides and right-hand sides transform differently under
  Lorentz transformations.
- The total energy $E$ and the momenta $(p_{x},p_{y},p_{z})$ transform
  as components of a contravariant 4-vector
  \begin{equation*}
  p^{\mu} = (p^{0},p^{1},p^{2},p^{3}) = \left(\frac{E}{c},p_{x},p_{y},p_{z}\right)
  \end{equation*}
  of invariant length
  \begin{equation*}\tag{1.7}
  \sum^{3}_{\mu=0}p^{\mu}p^{\mu} \equiv p_{\mu}p^{\mu} = \frac{\BDpos E^{2}}{c^{2}}\BDminus\vec{p}\cdot\vec{p}\equiv\BDpos m^{2}c^{2}
  \end{equation*}
  where $m$ is the rest mass of the particle, and $c$ is the speed of
  light in a vacuum.
- The operator prescription is asserted to be Lorentz covariant, since
  $p^{\mu}\to\I\hbar\partial/\partial x_{\mu}$.
- The relativistic Hamiltonian for a free particle is
  \begin{equation*}\tag{1.8}
  H = \sqrt{\vec{p}\cdot\vec{p}c^{2} + m^{2}c^{4}}
  \end{equation*}
  Therefore the relativistic counterpart to the Schrodinger equation
  would be
  \begin{equation*}\tag{1.9}
  \I\hbar\partial_{t}\psi = \sqrt{-\hbar^{2}c^{2}\nabla^{2} + m^{2}c^{4}}\psi
  \end{equation*}
  where $\nabla^{2}$ is the Laplacian operator. The right-hand side of
  Equation (1.9) is non-local: if we take the series expansion of it,
  we have infinitely many derivatives (which results in non-local behaviour).
- The trick is to rewrite Equation (1.9) as
  \begin{equation*}\tag{1.10}
  H^{2} = c^{2}\vec{p}\cdot\vec{p} + m^{2}c^{4}
  \end{equation*}
  Equivalently, iterate Equation (1.9) using the fact if $[A,B]=0$
  then $A\psi=B\psi$ implies $A^{2}\psi=B^{2}\psi$, which gives us
  \begin{equation*}
  -\hbar^{2}\partial_{t}^{2}\psi = (-\hbar^{2}c^{2}\nabla^{2}+m^{2}c^{4})\psi.
  \end{equation*}
  We can see this is the classical wave equation
  \begin{equation*}\tag{1.11}
  [\Box + (mc/\hbar)^{2}]\psi = 0,\quad\mbox{where}\quad\Box=\partial_{\mu}\partial^{\mu}
  \end{equation*}
  - Note that this is the {{{define(Klein-Gordon Equation)}}}.
- In squaring the energy relation, we have introduced extraneous
  negative-energy root $H=-\sqrt{c^{2}\vec{p}\cdot\vec{p}+m^{2}c^{4}}$.
  So we no longer have positive-definite energy, and introduced the
  difficulty of extra negative-energy solutions. We'll address this in
  Chapter 5. (Spoiler: they're antiparticles.)
- Let us study Equations (1.10) and (1.11). Our first task: construct
  a conserved current. In analogy to the non-relativistic case,
  multiply $\psi^{\ast}$ by (1.11), then subtracting $\psi$ times the
  complex-conjugate equation, i.e.,
  \begin{align*}
  \psi^{\ast}\left[\Box + (mc/\hbar)^{2}\right]\psi - \psi\left[\Box + (mc/\hbar)^{2}\right]\psi^{\ast} &= 0\\
  \nabla^{\mu}(\psi^{\ast}\nabla_{\mu}\psi - \psi\nabla_{\mu}\psi^{\ast}) &= 0
  \end{align*}
  Or equivalently
  \begin{equation*}\tag{1.12}
  \partial_{t}\left[\frac{\I\hbar}{2mc^{2}}\left(\psi^{\ast}\partial_{t}\psi-\psi\partial_{t}\psi^{\ast}\right)\right]+\frac{\hbar}{2\I m}\vec{\nabla}\cdot\left[\psi^{\ast}(\vec{\nabla}\psi)-\psi(\vec{\nabla}\psi^{\ast})\right]=0.
  \end{equation*}
- We would like to interpret
  \begin{equation*}
  \frac{\I\hbar}{2mc^{2}}\left(\psi^{\ast}\partial_{t}\psi-\psi\partial_{t}\psi^{\ast}\right)=\rho
  \end{equation*}
  as a probability density. But this is imposible: it is not a
  positive-definite expression.
- Therefore, following Dirac, we abandon Equation (1.11) in the hope
  of finding an equation which is first-order in the time derivative.

