docs/physics/bjorken-drell.html
<div id="outline-container-h-e9387302-f616-41ec-9bb6-1f402b758648" class="outline-3">
<h3 id="h-e9387302-f616-41ec-9bb6-1f402b758648"><span class="section-number-3">1.2.</span> Early Attempts</h3>
<div class="outline-text-3" id="text-h-e9387302-f616-41ec-9bb6-1f402b758648">
<ul class="org-ul">
<li><p>
The free particle has its Hamiltonian be
</p>
\begin{equation*}\tag{1.4}
H = \frac{p^{2}}{2m}.
\end{equation*}</li>
<li><p>
The quantum counterpart takes
</p>
\begin{equation*}\tag{1.5}
H\to\I\hbar\partial_{t},\quad\vec{p}\to-\I\hbar\vec{\nabla}
\end{equation*}</li>
<li><p>
Thus we obtain the nonrelativistic Schrodinger equation
</p>
\begin{equation*}\tag{1.6}
\I\hbar\partial_{t}\psi(q,t) = \frac{-\hbar^{2}}{2m}\nabla^{2}\psi(q,t).
\end{equation*}</li>
<li>Equations (1.4) and (1.6) are noncovariant and therefore
unsatisfactory for relativistic quantum mechanics. I.e., the
left-hand sides and right-hand sides transform differently under
Lorentz transformations.</li>
<li><p>
The total energy \(E\) and the momenta \((p_{x},p_{y},p_{z})\) transform
as components of a contravariant 4-vector
</p>
\begin{equation*}
p^{\mu} = (p^{0},p^{1},p^{2},p^{3}) = \left(\frac{E}{c},p_{x},p_{y},p_{z}\right)
\end{equation*}
<p>
of invariant length
</p>
\begin{equation*}\tag{1.7}
\sum^{3}_{\mu=0}p^{\mu}p^{\mu} \equiv p_{\mu}p^{\mu} = \frac{\BDpos E^{2}}{c^{2}}\BDminus\vec{p}\cdot\vec{p}\equiv\BDpos m^{2}c^{2}
\end{equation*}
<p>
where \(m\) is the rest mass of the particle, and \(c\) is the speed of
light in a vacuum.
</p></li>
<li>The operator prescription is asserted to be Lorentz covariant, since
\(p^{\mu}\to\I\hbar\partial/\partial x_{\mu}\).</li>
<li><p>
The relativistic Hamiltonian for a free particle is
</p>
\begin{equation*}\tag{1.8}
H = \sqrt{\vec{p}\cdot\vec{p}c^{2} + m^{2}c^{4}}
\end{equation*}
<p>
Therefore the relativistic counterpart to the Schrodinger equation
would be
</p>
\begin{equation*}\tag{1.9}
\I\hbar\partial_{t}\psi = \sqrt{-\hbar^{2}c^{2}\nabla^{2} + m^{2}c^{4}}\psi
\end{equation*}
<p>
where \(\nabla^{2}\) is the Laplacian operator. The right-hand side of
Equation (1.9) is non-local: if we take the series expansion of it,
we have infinitely many derivatives (which results in non-local behaviour).
</p></li>
<li><p>
The trick is to rewrite Equation (1.9) as
</p>
\begin{equation*}\tag{1.10}
H^{2} = c^{2}\vec{p}\cdot\vec{p} + m^{2}c^{4}
\end{equation*}
<p>
Equivalently, iterate Equation (1.9) using the fact if \([A,B]=0\)
then \(A\psi=B\psi\) implies \(A^{2}\psi=B^{2}\psi\), which gives us
</p>
\begin{equation*}
-\hbar^{2}\partial_{t}^{2}\psi = (-\hbar^{2}c^{2}\nabla^{2}+m^{2}c^{4})\psi.
\end{equation*}
<p>
We can see this is the classical wave equation
</p>
\begin{equation*}\tag{1.11}
[\Box + (mc/\hbar)^{2}]\psi = 0,\quad\mbox{where}\quad\Box=\partial_{\mu}\partial^{\mu}
\end{equation*}
<ul class="org-ul">
<li>Note that this is the <dfn>Klein-Gordon Equation</dfn>.</li>
</ul></li>
<li>In squaring the energy relation, we have introduced extraneous
negative-energy root \(H=-\sqrt{c^{2}\vec{p}\cdot\vec{p}+m^{2}c^{4}}\).
So we no longer have positive-definite energy, and introduced the
difficulty of extra negative-energy solutions. We'll address this in
Chapter 5. (Spoiler: they're antiparticles.)</li>
<li><p>
Let us study Equations (1.10) and (1.11). Our first task: construct
a conserved current. In analogy to the non-relativistic case,
multiply \(\psi^{\ast}\) by (1.11), then subtracting \(\psi\) times the
complex-conjugate equation, i.e.,
</p>
\begin{align*}
\psi^{\ast}\left[\Box + (mc/\hbar)^{2}\right]\psi - \psi\left[\Box + (mc/\hbar)^{2}\right]\psi^{\ast} &= 0\\
\nabla^{\mu}(\psi^{\ast}\nabla_{\mu}\psi - \psi\nabla_{\mu}\psi^{\ast}) &= 0
\end{align*}
<p>
Or equivalently
</p>
\begin{equation*}\tag{1.12}
\partial_{t}\left[\frac{\I\hbar}{2mc^{2}}\left(\psi^{\ast}\partial_{t}\psi-\psi\partial_{t}\psi^{\ast}\right)\right]+\frac{\hbar}{2\I m}\vec{\nabla}\cdot\left[\psi^{\ast}(\vec{\nabla}\psi)-\psi(\vec{\nabla}\psi^{\ast})\right]=0.
\end{equation*}</li>
<li><p>
We would like to interpret
</p>
\begin{equation*}
\frac{\I\hbar}{2mc^{2}}\left(\psi^{\ast}\partial_{t}\psi-\psi\partial_{t}\psi^{\ast}\right)=\rho
\end{equation*}
<p>
as a probability density. But this is imposible: it is not a
positive-definite expression.
</p></li>
<li>Therefore, following Dirac, we abandon Equation (1.11) in the hope
of finding an equation which is first-order in the time derivative.</li>
</ul>
</div>
</div>
