physics/bjorken-drell.org
** The Dirac Equation
:PROPERTIES:
:CUSTOM_ID: h-9c0bf147-d058-4998-bb58-bbfe083e4aac
:END:

- This section seems to have been imitated everywhere, introduce some
  matrix coefficients, which turn out to be the Gamma matrices.
- We have
  \begin{equation*}\tag{1.13}
  \I\hbar\partial_{t}\psi = \frac{\hbar c}{\I}\left(\alpha_{1}\partial_{x^{1}}+\alpha_{2}\partial_{x^{2}}+\alpha\partial_{x^{3}}\right)\psi+\beta m c^{2}\psi\equiv H\psi
  \end{equation*}
  where the $\alpha_{i}$ and $\beta$ are $N\times N$ matrices.
  - This equation is precisely the {{{dfn(Dirac Equation)}}}.
- The requirements for this equation to make sense:
  1. We should recover the energy-momentum relation $E^{2}=p^{2}c^{2}+m^{2}c^{4}$
  2. It must allow for a continuity equation and a probability
     interpretation for the wave function $\psi$
  3. It must be Lorentz covariant
- We will check the first two requirements.
- If we iterate Equation (1.13), we end up with
  \begin{align*}
  -\hbar^{2}\partial_{t}^{2}\psi &= -\hbar^{2}c^{2}\sum^{3}_{i,j=1}\frac{\alpha_{i}\alpha_{j}+\alpha_{j}\alpha_{i}}{2}\partial_{i}\partial_{j}\psi\\
  &\qquad + \frac{\hbar m c^{3}}{\I}\sum^{3}_{i=1}(\alpha_{i}\beta+\beta\alpha_{i})\partial_{i}\psi\\
  &\qquad + \beta^{2}m^{2}c^{4}\psi.
  \end{align*}
  This requires the four matrices $\alpha_{i}$, $\beta$ obey:
  \begin{equation*} \tag{1.16}
  \left.\begin{array}{rcl}
  \alpha_{i}\alpha_{j}+\alpha_{j}\alpha_{i} &=& 2\delta_{i,j}\\
  \alpha_{i}\beta+\beta\alpha_{i} &=& 0\\
  \alpha_{i}^{2}=\beta^{2}&=&1
  \end{array}\right\}
  \end{equation*}
- *Claim:* $N=4$ is the smallest dimension for the matrices. 
  - From $\alpha_{i}^{2}=\beta^{2}=1$ in Eq (1.16), the eigenvalues of
    $\alpha_{i}$ and $\beta$ must be $\pm1$.
  - From the anticommutation properties, it follows that the trace
    vanishes, i.e., $\tr(\alpha_{i})=0$ and $\tr(\beta)=0$.
  - Taken together, this means the number of $-1$ eigenvalues must be
    equal to the number of $+1$ eigenvalues, which means we must have
    $N$ be an even number.
  - When $N=2$, there are only three anticommuting matrices (the Pauli
    matrices). We need four anticommuting matrices. So this can't work.
  - When $N=4$, we have the possibility
    \begin{equation*}\tag{1.17}
    \alpha_{i} = \begin{bmatrix} 0 & \sigma_{i}\\ \sigma_{i} & 0\end{bmatrix},\qquad\beta=\begin{bmatrix}1&0\\ 0&-1\end{bmatrix}
    \end{equation*}
    where the $\sigma_{i}$ are the familiar Pauli matrices, and
    $\beta$ consists of $2\times 2$ identity matrices (or its negation).
- Thus we recover the familiar energy-momentum relations, which
  finishes the first task we setup for ourselves.
- *Goal 2:* now we want to consider the differential law of conservation.
- We introduce the Hermitian conjugate wave functions
  $\psi^{\dagger}=(\psi^{\ast}_{1},\dots,\psi^{\ast}_{4})$ and
  left-multiply Equation (1.13) by $\psi^{\dagger}$ to obtain
  \begin{equation*}\tag{1.18}
  \I\hbar\psi^{\dagger}\partial_{t}\psi = -\I\hbar c\sum^{3}_{k=1}\psi^{\dagger}\alpha_{k}\partial_{k}\psi+mc^{2}\psi^{\dagger}\beta\psi.
  \end{equation*}
- Now form the Hermitian conjugate of Equation (1.13), then multiply
  on the right by $\psi$:
  \begin{equation*}\tag{1.19}
  -\I\hbar(\partial_{t}\psi^{\dagger})\psi = \I\hbar c\sum^{3}_{k=1}(\partial_{k}\psi^{\dagger})\alpha_{k}\psi+mc^{2}\psi^{\dagger}\beta\psi,
  \end{equation*}
  where $\alpha_{i}^{\dagger}=\alpha_{i}$ and $\beta^{\dagger}=\beta$.
- Subtracting (1.19) from (1.18) gives us
  \begin{equation*}
  \I\hbar\partial_{t}(\psi^{\dagger}\psi)=-\I\hbar c\sum^{3}_{k=1}\partial_{k}(\psi^{\dagger}\alpha_{k}\psi),
  \end{equation*}
  or
  \begin{equation*}\tag{1.20}
  \partial_{t}\rho + \vec{\nabla}\cdot\vec{j}=0.
  \end{equation*}
  We identify the probability density
  \begin{equation*}\tag{1.21}
  \rho = \psi^{\dagger}\psi= \sum^{4}_{\sigma=1}\psi^{\ast}_{\sigma}\psi_{\sigma}
  \end{equation*}
  and the probability current with three components:
  \begin{equation*}\tag{1.22}
  j^{k} = c\psi^{\ast}\alpha^{k}\psi.
  \end{equation*}
- Integrating Equation (1.20) over all space, and using Green's
  theorem, we find
  \begin{equation*}\tag{1.23}
  \partial_{t}\int\psi^{\dagger}\psi\,\D^{3}x = 0,
  \end{equation*}
  which encourages a tentative interpretation of $\rho$ as a
  positive-definite probability density.
- We need to show that $\vec{j}$ transforms as a 3-vector under
  spatial rotations. We must show that $(\rho,\vec{j})$ transforms as
  a 4-vector under Lorentz transformations. Also, we must show that
  the Dirac equation (1.13) is Lorentz covariant.
  
** Nonrelativistic Correspondence
:PROPERTIES:
:CUSTOM_ID: h-d70ace27-4b3c-4710-bf69-f87d755a0d1b
:END:

- There are two problems facing us now:
  1. Establish the Lorentz invariance of the Dirac equation, and
  2. Check that the equation makes physical sense.
- We will check the Dirac equation makes physical sense.
- When a free electron is at rest, Equation (1.13) reduces to
  \begin{equation*}
  \I\hbar\partial_{t}\psi = \beta mc^{2}\psi,
  \end{equation*}
  since the de Broglie wavelength is infinitely large and the wave
  function is uniform over all space.

  
* Lorentz Covariance of the Dirac Equation
:PROPERTIES:
:CUSTOM_ID: h-43055381-a20c-4120-9f7b-82c26583e611
:END:

