docs/physics/bjorken-drell.html
<div id="outline-container-h-9c0bf147-d058-4998-bb58-bbfe083e4aac" class="outline-3">
<h3 id="h-9c0bf147-d058-4998-bb58-bbfe083e4aac"><span class="section-number-3">1.3.</span> The Dirac Equation</h3>
<div class="outline-text-3" id="text-h-9c0bf147-d058-4998-bb58-bbfe083e4aac">
<ul class="org-ul">
<li>This section seems to have been imitated everywhere, introduce some
matrix coefficients, which turn out to be the Gamma matrices.</li>
<li><p>
We have
</p>
\begin{equation*}\tag{1.13}
\I\hbar\partial_{t}\psi = \frac{\hbar c}{\I}\left(\alpha_{1}\partial_{x^{1}}+\alpha_{2}\partial_{x^{2}}+\alpha\partial_{x^{3}}\right)\psi+\beta m c^{2}\psi\equiv H\psi
\end{equation*}
<p>
where the \(\alpha_{i}\) and \(\beta\) are \(N\times N\) matrices.
</p>
<ul class="org-ul">
<li>This equation is precisely the <dfn>Dirac Equation</dfn>.</li>
</ul></li>
<li>The requirements for this equation to make sense:
<ol class="org-ol">
<li>We should recover the energy-momentum relation \(E^{2}=p^{2}c^{2}+m^{2}c^{4}\)</li>
<li>It must allow for a continuity equation and a probability
interpretation for the wave function \(\psi\)</li>
<li>It must be Lorentz covariant</li>
</ol></li>
<li>We will check the first two requirements.</li>
<li><p>
If we iterate Equation (1.13), we end up with
</p>
\begin{align*}
-\hbar^{2}\partial_{t}^{2}\psi &= -\hbar^{2}c^{2}\sum^{3}_{i,j=1}\frac{\alpha_{i}\alpha_{j}+\alpha_{j}\alpha_{i}}{2}\partial_{i}\partial_{j}\psi\\
&\qquad + \frac{\hbar m c^{3}}{\I}\sum^{3}_{i=1}(\alpha_{i}\beta+\beta\alpha_{i})\partial_{i}\psi\\
&\qquad + \beta^{2}m^{2}c^{4}\psi.
\end{align*}
<p>
This requires the four matrices \(\alpha_{i}\), \(\beta\) obey:
</p>
\begin{equation*} \tag{1.16}
\left.\begin{array}{rcl}
\alpha_{i}\alpha_{j}+\alpha_{j}\alpha_{i} &=& 2\delta_{i,j}\\
\alpha_{i}\beta+\beta\alpha_{i} &=& 0\\
\alpha_{i}^{2}=\beta^{2}&=&1
\end{array}\right\}
\end{equation*}</li>
<li><b>Claim:</b> \(N=4\) is the smallest dimension for the matrices. 
<ul class="org-ul">
<li>From \(\alpha_{i}^{2}=\beta^{2}=1\) in Eq (1.16), the eigenvalues of
\(\alpha_{i}\) and \(\beta\) must be \(\pm1\).</li>
<li>From the anticommutation properties, it follows that the trace
vanishes, i.e., \(\tr(\alpha_{i})=0\) and \(\tr(\beta)=0\).</li>
<li>Taken together, this means the number of \(-1\) eigenvalues must be
equal to the number of \(+1\) eigenvalues, which means we must have
\(N\) be an even number.</li>
<li>When \(N=2\), there are only three anticommuting matrices (the Pauli
matrices). We need four anticommuting matrices. So this can't work.</li>
<li><p>
When \(N=4\), we have the possibility
</p>
\begin{equation*}\tag{1.17}
\alpha_{i} = \begin{bmatrix} 0 & \sigma_{i}\\ \sigma_{i} & 0\end{bmatrix},\qquad\beta=\begin{bmatrix}1&0\\ 0&-1\end{bmatrix}
\end{equation*}
<p>
where the \(\sigma_{i}\) are the familiar Pauli matrices, and
\(\beta\) consists of \(2\times 2\) identity matrices (or its negation).
</p></li>
</ul></li>
<li>Thus we recover the familiar energy-momentum relations, which
finishes the first task we setup for ourselves.</li>
<li><b>Goal 2:</b> now we want to consider the differential law of conservation.</li>
<li><p>
We introduce the Hermitian conjugate wave functions
\(\psi^{\dagger}=(\psi^{\ast}_{1},\dots,\psi^{\ast}_{4})\) and
left-multiply Equation (1.13) by \(\psi^{\dagger}\) to obtain
</p>
\begin{equation*}\tag{1.18}
\I\hbar\psi^{\dagger}\partial_{t}\psi = -\I\hbar c\sum^{3}_{k=1}\psi^{\dagger}\alpha_{k}\partial_{k}\psi+mc^{2}\psi^{\dagger}\beta\psi.
\end{equation*}</li>
<li><p>
Now form the Hermitian conjugate of Equation (1.13), then multiply
on the right by \(\psi\):
</p>
\begin{equation*}\tag{1.19}
-\I\hbar(\partial_{t}\psi^{\dagger})\psi = \I\hbar c\sum^{3}_{k=1}(\partial_{k}\psi^{\dagger})\alpha_{k}\psi+mc^{2}\psi^{\dagger}\beta\psi,
\end{equation*}
<p>
where \(\alpha_{i}^{\dagger}=\alpha_{i}\) and \(\beta^{\dagger}=\beta\).
</p></li>
<li><p>
Subtracting (1.19) from (1.18) gives us
</p>
\begin{equation*}
\I\hbar\partial_{t}(\psi^{\dagger}\psi)=-\I\hbar c\sum^{3}_{k=1}\partial_{k}(\psi^{\dagger}\alpha_{k}\psi),
\end{equation*}
<p>
or
</p>
\begin{equation*}\tag{1.20}
\partial_{t}\rho + \vec{\nabla}\cdot\vec{j}=0.
\end{equation*}
<p>
We identify the probability density
</p>
\begin{equation*}\tag{1.21}
\rho = \psi^{\dagger}\psi= \sum^{4}_{\sigma=1}\psi^{\ast}_{\sigma}\psi_{\sigma}
\end{equation*}
<p>
and the probability current with three components:
</p>
\begin{equation*}\tag{1.22}
j^{k} = c\psi^{\ast}\alpha^{k}\psi.
\end{equation*}</li>
<li><p>
Integrating Equation (1.20) over all space, and using Green's
theorem, we find
</p>
\begin{equation*}\tag{1.23}
\partial_{t}\int\psi^{\dagger}\psi\,\D^{3}x = 0,
\end{equation*}
<p>
which encourages a tentative interpretation of \(\rho\) as a
positive-definite probability density.
</p></li>
<li>We need to show that \(\vec{j}\) transforms as a 3-vector under
spatial rotations. We must show that \((\rho,\vec{j})\) transforms as
a 4-vector under Lorentz transformations. Also, we must show that
the Dirac equation (1.13) is Lorentz covariant.</li>
</ul>
</div>
</div>
<div id="outline-container-h-d70ace27-4b3c-4710-bf69-f87d755a0d1b" class="outline-3">
<h3 id="h-d70ace27-4b3c-4710-bf69-f87d755a0d1b"><span class="section-number-3">1.4.</span> Nonrelativistic Correspondence</h3>
<div class="outline-text-3" id="text-h-d70ace27-4b3c-4710-bf69-f87d755a0d1b">
<ul class="org-ul">
<li>There are two problems facing us now:
<ol class="org-ol">
<li>Establish the Lorentz invariance of the Dirac equation, and</li>
<li>Check that the equation makes physical sense.</li>
</ol></li>
<li>We will check the Dirac equation makes physical sense.</li>
<li><p>
When a free electron is at rest, Equation (1.13) reduces to
</p>
\begin{equation*}
\I\hbar\partial_{t}\psi = \beta mc^{2}\psi,
\end{equation*}
<p>
since the de Broglie wavelength is infinitely large and the wave
function is uniform over all space.
</p></li>
</ul>
</div>
</div>
</div>
