physics/bjorken-drell.org
** Covariant form of the Dirac Equation
:PROPERTIES:
:CUSTOM_ID: h-1c54f957-f7a0-4697-a67a-1acd5fa312b2
:END:

- Review of what is meant by a "Lorentz transformation"
  - Let $O$ and $O'$ be two observers in different inertial reference
    frames which describe the same physical event with different
    spacetime coordinates.
  - The rule relating the coordinates $x^{\mu}$ which observer $O$
    describes the event, to the coordinates $(x^{\mu})'$ which
    observer $O'$ describes the same event, is given by the Lorentz
    transformation between the two sets of coordinates:
    \begin{equation*}\tag{2.1}
    (x^{\nu})' = \sum^{3}_{\mu=0}{a^{\nu}}_{\mu}x^{\mu}\equiv {a^{\nu}}_{\mu}x^{\mu}
    \end{equation*}
    This is a linear homogeneous transformation, and the coefficients
    ${a^{\nu}}_{\mu}$ depend only upon the relative velocities and
    spatial orientations of the reference frames of $O$ and $O'$.
    - Note: Equation (2.1) describes familiar matrix multiplication
      taught in elementary linear algebra. Here $x^{\mu}$ describes a
      column vector, and ${a^{\nu}}_{\mu}$ describes a matrix with
      $\mu$ indexing rows, $\nu$ indexing columns. Einstein summation
      convention here is just describing familiar matrix multiplication.
  - The basic invariant of the Lorentz transformation is the proper
    time interval
    \begin{equation*}\tag{2.2}
    \D s^{2}=g_{\mu\nu}\,\D x^{\mu}\D x^{\nu}
    \end{equation*}
    (Note that $\D s=c\,\D\tau$ gives us the "infinitesimal" proper
    time interval $\D\tau$ explicitly.) This is derived from the
    physical observation that the velocity of light is constant in a vacuum.
  - Now equations (2.1) and (2.2) taken together leads us to the
    condition on the coefficients that
    \begin{equation*}\tag{2.3}
    {a_{\mu}}^{\nu}{a^{\mu}}_{\sigma}={\delta^{\nu}}_{\sigma}
    \end{equation*}
    where ${\delta^{\nu}}_{\sigma}$ is the Kronecker delta (1 when
    $\nu=\sigma$, and 0 otherwise).
  - There are two classes of Lorentz transformations, since Equations
    (2.1) and (2.3) implies $\det({a^{\mu}}_{\nu})=\pm1$. When the
    determinant is positive, we have {{{dfn(Proper Lorentz Transformations)}}};
    otherwise, the determinant is negative, and we call it an
    {{{dfn(Improper Lorentz Transformation)}}}.
  - Proper Lorentz transformations.
    - These form a subgroup: if $A$ is a proper Lorentz
      transformation, then $A^{-1}$ is a proper Lorentz
      transformation; further, if $A$ and $B$ are proper Lorentz
      transformations, then $AB$ is another proper Lorentz
      transformation. The identity matrix is a proper Lorentz
      transformation describing the case when $O=O'$.
      (We should check associativity, but we know
      matrix multiplication is associative.)
  - Improper Lorentz transformations are the discrete transformations
    of space inversion and time inversion (possibly composed with
    proper Lorentz transformations).
    - Improper Lorentz transformations cannot be built out of
      infinitesimal Lorentz transformations.
- Now, we want to construct a correspondence relating a given set of
  observations of a Dirac particle made by observers $O$ and $O'$ in
  their respective reference frame.
  - We have wave functions $\psi(x)$ used by observer $O$, and $\psi'(x')$ used by
    observer $O'$.
  - We seek a transformation law relating these two wave functions to
    each other. Specifically, for $O'$ to compute $\psi'(x')$ from $\psi(x)$.
  - Lorentz covariance requires this transformation yield wave
    functions which are solutions of Dirac equations of the same form
    in the primed as well as unprimed reference frame.
  - This invariance expresses the Lorentz invariance of the underlying
    momentum shell
    \begin{equation*}
    p^{\mu}p_{\mu}=m^{2}c^{2}.
    \end{equation*}
  - *Gamma matrices.* Towards this end, we introduce the notation
    \begin{equation*}
    \gamma^{0}=\beta,\quad\gamma^{i}=\beta\alpha_{i}.
    \end{equation*}
    Then we have Dirac's equation be
    \begin{equation*}\tag{2.4}
    \I\hbar\left(\gamma^{0}\partial_{0}+\gamma^{1}\partial_{1}+\dots+\gamma^{3}\partial_{3}\right)\psi-mc\psi=0.
    \end{equation*}
  - We see the defining relations from Equation (1.16) is:
    \begin{equation*}\tag{2.5}
    \gamma^{\mu}\gamma^{\nu}+\gamma^{\nu}\gamma^{\mu}=2g^{\mu\nu}\mathbf{1}
    \end{equation*}
    where $\mathbf{1}$ is the $4\times 4$ identity matrix
  - The $\gamma^{i}$ are anti-Hermitian and $(\gamma^{i})^{2}=-\mathbf{1}$.
  - The $\gamma^{0}$ is Hermitian.
  - The representation from Equation (1.17) gives us
    \begin{equation*}\tag{2.6}
    \gamma^{i}=\begin{bmatrix}0 & \sigma^{i}\\-\sigma^{i}&0\end{bmatrix},\quad
    \gamma^{0}=\begin{bmatrix}1 & 0\\ 0 & -1\end{bmatrix}.
    \end{equation*}
  - *Feynman slash notation.* We have
    \begin{equation*}
    \cancel{A} = \gamma^{\mu}A_{\mu} = g_{\mu\nu}\gamma^{\mu}A^{\nu} = \gamma^{0}A^{0}-\vec{\gamma}\cdot\vec{A},
    \end{equation*}
    so we have in particular
    \begin{equation*}
    \cancel{\nabla} = \gamma^{\mu}\partial_{\mu} = \frac{\gamma^{0}}{c}\partial_{t}+\vec{\gamma}\cdot\vec{\nabla}.
    \end{equation*}
  - We can then simplify the Dirac Equation (2.4) to:
    \begin{equation*}\tag{2.7}
    (\I\hbar\cancel{\nabla} - mc)\psi = 0
    \end{equation*}
    Or, using $p^{\mu}=\I\hbar\partial_{\mu}$
    \begin{equation*}\tag{2.8}
    (\cancel{p} - mc)\psi = 0
    \end{equation*}
  - We can add electromagnetic interaction according to the "minimal"
    substitution from Equation (1.25):
    \begin{equation*}
    \left(\cancel{p} - \frac{e\cancel{A}}{c}  - mc\right)\psi = 0
    \end{equation*}
    This does not affect concerns of covariance, since both $p^{\mu}$
    and $A^{\mu}$ are 4-vectors.

